# frozen_string_literal: true

describe FetchBelhydrometRadData, type: :service do
  subject { described_class.new }

  describe '#execute' do
    subject { super().execute }

    let(:rad_data_url) { 'spec/test_examples/belhydromet_rad_data.xml' }

    before do
      stub_const("#{described_class}::RAD_DATA_URL", rad_data_url)
    end

    it 'fetches rad data and parses it' do
      expect(subject).to eq(
        { 'Высокое' => 0.1,
          'Полесская, болотная' => 0.1,
          'Жлобин' => 0.1,
          'Мозырь' => 0.1,
          'Житковичи' => 0.11,
          'Василевичи' => 0.11,
          'Октябрь' => 0.11,
          'Гомель' => 0.11,
          'Брест' => 0.1,
          'Барановичи' => 0.1,
          'Пинск' => 0.1,
          'Ивацевичи' => 0.1,
          'Вилейка' => 0.1,
          'Слуцк' => 0.1,
          'Славгород' => 0.2,
          'Лида' => 0.1,
          'Сенно' => 0.1,
          'Костюковичи' => 0.1,
          'Борисов' => 0.1,
          'Пружаны' => 0.1,
          'Горки' => 0.11,
          'Брагин' => 0.47,
          'Мстиславль' => 0.13,
          'Минск' => 0.1,
          'Могилев' => 0.13,
          'Орша' => 0.1,
          'Полоцк' => 0.1,
          'Олтуш' => 0.1,
          'Верхний Теребежов' => 0.1,
          'Мокраны' => 0.1,
          'Волковыск' => 0.1,
          'Верхнедвинск' => 0.1,
          'Березино' => 0.1,
          'Шарковщина' => 0.1,
          'Ошмяны' => 0.1,
          'Воложин' => 0.1,
          'Лынтупы' => 0.1,
          'Столбцы' => 0.1,
          'Нарочь, озерная' => 0.1,
          'Витебск' => 0.1,
          'Бобруйск' => 0.11,
          'Дрогичин' => 0.1 }
      )
    end
  end
end
